2024-5-21/93579856c8-TODO.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python async def</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">python async def</h1>
<p>
<a href="extmod/asyncio/task.py">extmod/asyncio/task.py</a>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;pairing-heap&#31639;&#27861;&#65292;&#20316;&#20026;&#19968;&#20010;&#23481;&#22120;&#65292;&#23384;&#25918;&#21516;&#19968;&#31867;Task</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TaskQueue</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20219;&#21153;&#30340;&#23545;&#24212;&#23454;&#20363;&#12290;async def&#20462;&#39280;&#30340;&#31867;&#65292;&#22312;&#30452;&#25509;&#25191;&#34892;&#26102;&#65292;&#20250;&#33258;&#21160;&#21019;&#24314;&#27492;Task&#65292;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#24182;&#23558;&#23545;&#24212;&#20219;&#21153;&#25918;&#21040;Task::coro&#20013;&#12290;&#24182;&#25918;&#20837;&#40664;&#35748;event loop&#20013;&#65292;event loop&#26159;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26356;&#24213;&#23618;&#23454;&#29616;&#12290;&#26080;&#35770;&#26159;asyncio.run&#36824;&#26159;&#20854;&#20182;&#20219;&#21153;&#36816;&#34892;&#26041;&#24335;&#65292;&#37117;&#20250;&#23558;&#21327;&#31243;&#21019;&#24314;&#25104;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Task&#65292;&#24182;&#30001;asyncio.core.run_until_complete(main_task)&#24320;&#22987;&#36816;&#34892;&#12290;</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Task</span>
</pre>
</div>
<p>
<a href="extmod/asyncio/core.py">extmod/asyncio/core.py</a>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36827;&#31243;&#65292;&#32447;&#31243;&#21644;&#21327;&#31243;&#65306;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36827;&#31243;&#26159;&#36164;&#28304;&#20998;&#37197;&#30340;&#22522;&#26412;&#21333;&#20301;&#65292;&#32447;&#31243;&#26159;&#25805;&#20316;&#31995;&#32479;&#35843;&#24230;&#30340;&#22522;&#26412;&#21333;&#20301;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21327;&#31243;&#26159;&#19968;&#31181;&#27604;&#32447;&#31243;&#26356;&#21152;&#36731;&#37327;&#32423;&#30340;&#23384;&#22312;&#65292;&#27491;&#22914;&#19968;&#20010;&#36827;&#31243;&#21487;&#20197;&#25317;&#26377;&#22810;&#20010;&#32447;&#31243;&#19968;&#26679;&#65292;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#19968;&#20010;&#32447;&#31243;&#20063;&#21487;&#20197;&#25317;&#26377;&#22810;&#20010;&#21327;&#31243;&#12290;&#24182;&#19988;&#65292;&#21327;&#31243;&#19981;&#26159;&#30001;&#25805;&#20316;&#31995;&#32479;&#25511;&#21046;&#65292;&#32780;&#26159;&#30001;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31243;&#24207;&#23436;&#20840;&#25511;&#21046;(&#20063;&#23601;&#26159;&#19968;&#30452;&#22312;&#29992;&#25143;&#24577;)&#12290;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21327;&#31243;&#23454;&#29616;&#65306;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">yield&#20851;&#38190;&#23383;&#65292;&#26242;&#20572;&#65292;&#31561;&#21040;&#20027;&#32447;&#31243;&#35843;&#29992;send&#26041;&#27861;&#21457;&#36865;&#21644;&#25968;&#25454;&#65292;&#21327;&#31243;&#25165;&#20250;&#25509;&#21040;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25968;&#25454;&#32487;&#32493;&#25191;&#34892;&#12290;&#21327;&#31243;&#20063;&#26377;&#33258;&#24049;&#30340;&#29615;&#22659;&#65292;&#20063;&#23601;&#26159;&#19978;&#19979;&#25991;&#12290;&#21327;&#31243;&#30340;&#35843;&#24230;&#23436;&#20840;&#30001;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#29992;&#25143;&#25511;&#21046;&#65292;&#21327;&#31243;&#25317;&#26377;&#33258;&#24049;&#30340;&#23492;&#23384;&#22120;&#21644;&#26632;&#12290;&#21327;&#31243;&#35843;&#24230;&#26102;&#65292;&#23558;&#23492;&#23384;&#22120;&#19978;&#19979;&#25991;&#21644;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#26632;&#20445;&#23384;&#21040;&#20854;&#20182;&#22320;&#26041;&#12290;</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#22312;mp&#21327;&#31243;&#20013;&#20316;&#20026;yield&#12290;&#20301;&#20110;&#21644;&#21327;&#31243;&#19981;&#21516;&#30340;&#26159;&#65292;&#19981;&#29992;user&#36127;&#36131;send&#21551;&#21160;&#32487;&#32493;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#32780;&#26159;&#26694;&#26550;&#20250;send&#12290;&#21482;&#21462;&#20854;&#35753;&#20986;&#32447;&#31243;&#21151;&#33021;&#65292;&#24182;&#30001;&#30561;&#30496;&#21151;&#33021;&#27169;&#25311;&#12290;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#20856;&#22411;&#29992;&#27861;&#65306;await asyncio.sleep_ms()</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sleep_ms</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31616;&#21333;&#30340;&#23558;coro&#21253;&#35013;&#36827;Task&#65292;&#24182;&#25918;&#36827;&#40664;&#35748;event loop&#20013;&#12290;</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">create_task</span>(coro):
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#21327;&#31243;&#24517;&#26377;&#27492;send&#26041;&#27861;&#65292;&#29992;&#26469;&#21796;&#37266;&#27492;&#21327;&#31243;&#32487;&#32493;&#36816;&#34892;</span>
    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">hasattr</span>(coro, <span style="font-style: italic;">"send"</span>):
        <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">"coroutine expected"</span>)
    <span style="font-weight: bold; font-style: italic;">t</span> = Task(coro, <span style="font-weight: bold;">globals</span>()) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">wrapper</span>
    _task_queue.push(t) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">push into default event loop. </span>
    <span style="font-weight: bold;">return</span> t

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create a new task from a coroutine and run it until it finishes</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">run</span>(coro):
    <span style="font-weight: bold;">return</span> run_until_complete(create_task(coro))

<span style="font-style: italic;">''' &#20027;&#35201;&#36923;&#36753;:</span>
<span style="font-style: italic;">1. main_task&#22914;&#26524;&#32467;&#26463;&#65292;&#21017;&#20572;&#27490;&#21097;&#20313;&#21327;&#31243;&#12290;&#32780;Loop.run_forever&#19981;&#36807;&#26159;&#37319;&#29992;&#20102;</span>
<span style="font-style: italic;">&#19968;&#20010;&#19981;&#20250;</span>
<span style="font-style: italic;">'''</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">run_until_complete</span>(main_task=<span style="font-weight: bold; text-decoration: underline;">None</span>)
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
